{
  "ir_version": "1.0",
  "project": "chathub",
  "repository": "https://github.com/grokify/chathub",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-01-11",
      "highlights": [
        {"description": "Cross-platform AI conversation sharing between ChatGPT, Claude Code, and other MCP clients"},
        {"description": "Hugo-compatible storage for publishing conversations to static sites"},
        {"description": "GitHub-based version-controlled conversation storage with automatic organization"}
      ],
      "added": [
        {"description": "MCP server with stdio and HTTP transport support", "commit": "8d4d384"},
        {"description": "`save_conversation` tool - Save AI conversations with Hugo-compatible frontmatter", "commit": "8d4d384"},
        {"description": "`read_conversation` tool - Read conversations from storage", "commit": "8d4d384"},
        {"description": "`list_conversations` tool - List conversations with optional source filtering", "commit": "8d4d384"},
        {"description": "`search_conversations` tool - Search conversations by content", "commit": "8d4d384"},
        {"description": "`delete_conversation` tool - Delete conversations from storage", "commit": "8d4d384"},
        {"description": "`append_conversation` tool - Append content to existing conversations", "commit": "8d4d384"},
        {"description": "Hugo-compatible YAML frontmatter with standard and extension fields", "commit": "8d4d384"},
        {"description": "GitHub storage backend via omnistorage-github", "commit": "8d4d384"},
        {"description": "File organization by source platform (chatgpt/, claude/, gemini/, etc.)", "commit": "8d4d384"},
        {"description": "Automatic slug generation and date-based file naming", "commit": "8d4d384"},
        {"description": "Cross-platform conversation sharing between ChatGPT Desktop, Claude Code, and other MCP clients", "commit": "8d4d384"}
      ]
    }
  ]
}
